"""
元祖（tuple）：一级元素不可被修改，不可以增加或删除
元祖的基本格式：tu = (111,'洪吉昌',[],(),True,'red',2,)
特征：
a：括号括起来
b：元祖中可以是数字，字符串，列表，布尔值，所有的都可以放进去
c：,分割每个元素有n个，既有n+1个元素
c*：特别最后一个元素可在后加上，无影响算元素个数不计此逗号；为了区别出来这是元祖
"""
#元素不可被修改，不可以增加或删除
#1:索引取值————》取值类型不唯一
tu = (111,'洪吉昌',[],(),True,'red',2,)
v = tu[1]
print(v,type(v))
#2:切片取值————》取值类型是元祖
tu = (111,'洪吉昌',[],(),True,'red',2,)
v = tu[0:5]
print(v,type(v))
#3:for循环
tu = (111,'洪吉昌',[],(),True,'red',2,)
for item in tu:
    print(item)
#while循环
tu = (111,'洪吉昌',[],(),True,'red',2,)
count = 0
l = len(tu)
while count < l:
    v = tu[count]
    print(v)
    count += 1
#4:元祖，列表，字符串可相互转化
s = '洪吉昌123'
li = ['洪吉昌',123]
tu = ('洪吉昌',123)
v = list(s)
v = list(tu)
v = tuple(s)
v = tuple(li)
#转化为字符串时：
#a:元祖，列表只有字符串，直接可以join拼接    v = ''.join()
#b：元祖，列表既有字符串又有数字，蓄意写for循环一个一个拼接
s = ''
for item in li: #tu:
    s = s + str(item)
print(s)
#5：元祖，有序
tu = (111,'洪吉昌',[0,(12,'帅气')],(),True,'red',2,)
v = tu[2][1][1]
print(v)        #帅气
#6:元祖的一级元素不可被增/删/改(最重要）
tu = (111,'洪吉昌',[0,(12,'帅气')],(),True,'red',2,)
tu[2][1] = '洪吉昌'
print(tu)       #(111, '洪吉昌', [0, '洪吉昌'], (), True, 'red', 2)
del tu[2][1]
print(tu)       #(111, '洪吉昌', [0], (), True, 'red', 2)
#7:获取元祖中指定元素出现的次数
tu = (11,22,33,44,22)
v = tu.count(22)
print(v)
#8：寻找指定元素的位置（从左到右），可以加参数规定寻找范围，找不到直接报错
tu = (11,22,33,44,22)
v = tu.index(33,0,4)
print(v)